import React from "react";

const Policy = () => {
  return (
    <div className="min-h-screen py-20 bg-gray-100">
      <div className="max-w-5xl mx-auto bg-white rounded-lg shadow-lg">
        <div className="p-8">
          <h2 className="text-2xl font-bold mb-6">Политика конфиденциальности</h2>
          <p className="text-lg">
            Сбор персональной информации
          </p>
          <p className="mb-6">
            Мы можем собирать следующую персональную информацию о вас:
          </p>
          <ul className="list-disc pl-6 mb-6">
            <li>Имя, фамилия и контактная информация (например, адрес электронной почты, номер телефона) для обработки заказов, доставки и связи с вами относительно вопросов или запросов.</li>
            <li>Информация о вашей покупательской истории и предпочтениях, которую вы предоставляете нам при покупке товаров или взаимодействии с нашим магазином.</li>
            <li>Информация, которую вы предоставляете нам при участии в опросах, акциях или промо-мероприятиях.</li>
          </ul>
          <p className="text-lg">
            Использование персональной информации
          </p>
          <p className="mb-6">
            Мы используем собранную персональную информацию для следующих целей:
          </p>
          <ul className="list-disc pl-6 mb-6">
            <li>Обработка и выполнение ваших заказов, включая доставку товаров и связь с вами относительно заказа.</li>
            <li>Предоставление вам информации о наших товарах, акциях и специальных предложениях, если вы дали согласие на получение такой информации.</li>
            <li>Улучшение и персонализация вашего опыта покупок, включая анализ ваших предпочтений, предоставление рекомендаций и индивидуального подхода.</li>
            <li>Обеспечение обслуживания клиентов и поддержки, включая ответы на ваши вопросы и запросы.</li>
            <li>Анализ и сбор статистической информации для улучшения нашего магазина и предложения товаров.</li>
          </ul>
          <p className="text-lg">
            Раскрытие персональной информации
          </p>
          <p className="mb-6">
            Мы не продаем, не арендуем и не раскрываем вашу персональную информацию третьим сторонам без вашего согласия, за исключением следующих случаев:
          </p> 
          <ul className="list-disc pl-6 mb-6">
            <li>Предоставление информации службам доставки для выполнения заказов и доставки товаров.</li>
            <li>Соблюдение законов и правил, включая сотрудничество с правоохранительными органами в рамках расследования преступлений или предотвращения мошенничества.</li>
            <li>Защита наших прав и интересов, включая принятие мер по предотвращению потенциальных нарушений и обеспечению безопасности нашего магазина и наших пользователей.</li>
          </ul>
          <p className="text-lg">
            Защита персональной информации
          </p>
          <p className="mb-6">
            Мы принимаем меры безопасности для защиты вашей персональной информации от несанкционированного доступа, использования или раскрытия. Мы применяем технические, физические и административные меры безопасности, чтобы обеспечить защиту ваших данных.
          </p>
          <p className="text-lg">
            Сохранение персональной информации
          </p>
          <p className="mb-6">
            Мы сохраняем вашу персональную информацию только на период, необходимый для достижения целей, указанных в настоящей политике конфиденциальности, или в соответствии с требованиями закона. После истечения этого срока мы удаляем или анонимизируем вашу информацию.
          </p>
          <p className="text-lg">
            Ваши права
          </p>
          <p className="mb-6">
            У вас есть определенные права относительно вашей персональной информации, включая:
          </p>
          <ul className="list-disc pl-6 mb-6">
            <li>Право на доступ к вашей персональной информации и запрос ее исправления, обновления или удаления.</li>
            <li>Право на ограничение обработки ваших персональных данных или возражение против определенных типов обработки.</li>
            <li>Право на отзыв вашего согласия на обработку данных, если вы дали такое согласие.</li>
            <li>Право на передачу вашей персональной информации в машиночитаемом формате или на передачу ее другому ответственному лицу.</li>
          </ul>
          <p className="mb-6">
            Вы можете связаться с нами, чтобы упражнить свои права или задать вопросы о нашей политике конфиденциальности.
          </p>
          <p className="text-lg">
            Изменения в политике конфиденциальности
          </p>
          <p className="mb-6">
            Мы можем время от времени обновлять эту политику конфиденциальности. Любые изменения будут опубликованы на нашем веб-сайте, и мы рекомендуем вам регулярно проверять эту политику для ознакомления с изменениями.
          </p>
        </div>
      </div>
    </div>
  );
};

export default Policy;
